app/controllers/album_roots_controller.rb

SELECT * FROM "albumroots"
---
  def index
    @album_roots = AlbumRoot.all

SELECT * FROM "albumroots" WHERE ("albumroots"."id" = 3)
SELECT "albums".* FROM "albums" INNER JOIN "images" ON images.album = albums.id WHERE (albumRoot = '1') GROUP BY albums.id HAVING count(images.id) > 0 LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "images" WHERE ("images".album = 5)
SELECT count(*) AS count_all, albums.id AS albums_id FROM "albums" INNER JOIN "images" ON images.album = albums.id WHERE (albumRoot = '1') GROUP BY albums.id HAVING count(images.id) > 0
---
  def show
    @album_root = AlbumRoot.find(params[:id])
    @albums = Album.paginate :page => params[:page], :conditions => ["albumRoot = ?", params[:id]], :having => "count(images.id) > 0", :joins => :images, :group => "albums.id"