app/controllers/albums_controller.rb

SELECT * FROM "albums" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "albums"
---
  def index
    @albums = Album.paginate :page => params[:page]

SELECT * FROM "albums" WHERE ("albums"."id" = 1)
---
  def show
    @album = Album.find(params[:id])