app/controllers/image_metadatas_controller.rb

  def show
    @image_metadata = ImageMetadata.find(params[:id])
---
SELECT * FROM "imagemetadata" WHERE ("imagemetadata"."imageid" = 18135)