app/controllers/images_controller.rb

  def index
    @images = Image.paginate :page => params[:page]
---
SELECT * FROM "images" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 18)

  def edit
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)