app/controllers/thumbnails_controller.rb

  def index
    @thumbnails = Thumbnail.paginate :page => params[:page]
---
SELECT * FROM "thumbnails" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "thumbnails"

  def show
    @thumbnail = Thumbnail.find(params[:id])
---
SELECT * FROM "thumbnails" WHERE ("thumbnails"."id" = 1)